//
//  MarketDataModel.swift
//  SwiftCrypto
//
//  Created by Сергей Герасимов on 24.05.2023.
//

import Foundation

//JSON Data:
/*
 
 
 URL: https://api.coingecko.com/api/v3/global
 
 JSON RESPONSE:
 {
 "data": {
   "active_cryptocurrencies": 10207,
   "upcoming_icos": 0,
   "ongoing_icos": 49,
   "ended_icos": 3376,
   "markets": 744,
   "total_market_cap": {
     "btc": 43552056.899650335,
     "eth": 639971899.0064945,
     "ltc": 12980003614.456137,
     "bch": 10274773724.51057,
     "bnb": 3783807458.0507426,
     "eos": 1377467993944.185,
     "xrp": 2570351855574.9517,
     "xlm": 13448048269118.426,
     "link": 182368140562.33936,
     "dot": 220475541836.3789,
     "yfi": 176421556.75289774,
     "usd": 1183118648501.6997,
     "aed": 4344802106452.251,
     "ars": 277932672248371.53,
     "aud": 1790117671115.4963,
     "bdt": 127004439874000.81,
     "bhd": 446033364247.84607,
     "bmd": 1183118648501.6997,
     "brl": 5884832157647.457,
     "cad": 1598251319887.9788,
     "chf": 1066390979521.8762,
     "clp": 947973817111988.8,
     "cny": 8348913366881.953,
     "czk": 26022298329047.645,
     "dkk": 8176820477626.848,
     "eur": 1097879682351.7452,
     "gbp": 953009170080.0103,
     "hkd": 9271756560781.1,
     "huf": 411879095102897.3,
     "idr": 17614921154150002,
     "ils": 4378367182510.245,
     "inr": 98058399810877.62,
     "jpy": 163785621664657.03,
     "krw": 1561811168498397.5,
     "kwd": 363536867125.11755,
     "lkr": 362379034088371.5,
     "mmk": 2486957501610799,
     "mxn": 21253780025414.273,
     "myr": 5380823613385.754,
     "ngn": 546009256283532.7,
     "nok": 12967571946902.871,
     "nzd": 1893504494214.819,
     "php": 65969511538687.516,
     "pkr": 339111382626800.1,
     "pln": 4926781719006.176,
     "rub": 94838780215828.67,
     "sar": 4436544675813.006,
     "sek": 12567493277200.154,
     "sgd": 1593725891057.4597,
     "thb": 40912242865188.79,
     "try": 23492713755838.88,
     "twd": 36435321899258.36,
     "uah": 43739300143309.22,
     "vef": 118465670274.47508,
     "vnd": 27766221864882850,
     "zar": 22713890411903.176,
     "xdr": 884691166840.9297,
     "xag": 50308015105.82455,
     "xau": 598326762.9202801,
     "bits": 43552056899650.336,
     "sats": 4355205689965033.5
   },
   "total_volume": {
     "btc": 1274722.5467343777,
     "eth": 18731299.208661355,
     "ltc": 379910948.91717494,
     "bch": 300731737.1807699,
     "bnb": 110748034.02265255,
     "eos": 40317028271.05104,
     "xrp": 75231474621.08138,
     "xlm": 393610119901.25116,
     "link": 5337722191.0890875,
     "dot": 6453085438.188964,
     "yfi": 5163671.98548326,
     "usd": 34628628911.41957,
     "aed": 127167752810.27356,
     "ars": 8134794749314.808,
     "aud": 52394846974.42336,
     "bdt": 3717285349249.699,
     "bhd": 13054923842.347422,
     "bmd": 34628628911.41957,
     "brl": 172242800205.401,
     "cad": 46779122223.85854,
     "chf": 31212133754.390083,
     "clp": 27746188915274.984,
     "cny": 244363845639.21472,
     "czk": 761645092315.9884,
     "dkk": 239326869163.64658,
     "eur": 32133774712.867405,
     "gbp": 27893568359.921936,
     "hkd": 271374487847.78174,
     "huf": 12055264582932.512,
     "idr": 515570072979116.44,
     "ils": 128150167012.49054,
     "inr": 2870065435109.7554,
     "jpy": 4793831557666.823,
     "krw": 45712557613839.266,
     "kwd": 10640338805.6119,
     "lkr": 10606450259757.572,
     "mmk": 72790610266192.4,
     "mxn": 622075615490.5245,
     "myr": 157491004289.13687,
     "ngn": 15981112242620.082,
     "nok": 379547087183.61395,
     "nzd": 55420869711.84782,
     "php": 1930857684843.2117,
     "pkr": 9925430761735.646,
     "pln": 144201679257.68735,
     "rub": 2775830581881.7397,
     "sar": 129852960581.95139,
     "sek": 367837208545.44464,
     "sgd": 46646667718.27236,
     "thb": 1197457987756.8892,
     "try": 687606832842.4946,
     "twd": 1066423255956.0774,
     "uah": 1280202958026.2168,
     "vef": 3467364612.900438,
     "vnd": 812687885909687,
     "zar": 664811499002.6852,
     "xdr": 25893972812.06097,
     "xag": 1472462283.1157966,
     "xau": 17512390.21308312,
     "bits": 1274722546734.3777,
     "sats": 127472254673437.78
   },
   "market_cap_percentage": {
     "btc": 44.50247446327985,
     "eth": 18.79196267364182,
     "usdt": 7.010781923234036,
     "bnb": 4.173445058159544,
     "usdc": 2.474660659999993,
     "xrp": 2.0179117282365824,
     "ada": 1.0963695778151061,
     "steth": 1.0374080931221465,
     "doge": 0.8565568413239812,
     "matic": 0.6918944822500944
   },
   "market_cap_change_percentage_24h_usd": 1.1871982091122542,
   "updated_at": 1684867376
 }
}
 
 
 */

struct GlobalData: Codable{
    let data: MarketDataModel?
}

struct MarketDataModel: Codable  {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey{
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String{
        if let item = totalMarketCap.first(where: { $0.key == "rub"}) {
            return "₽" + item.value.formattedWithAbbreviations()
        }
        
        return ""
    }
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "rub"}) {
            return "₽" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc"}) {
            return item.value.asPercentString()
        }
        return ""
    }
    
}
